Торговля_11__демо/src/DataProcessors/НастройкаПоддержанияЗапасов/НастройкаПоддержанияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаПоддержанияЗапасов</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеАссортимента</name>
    <type>
      <types>DocumentRef.ИзменениеАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Торговля_11__демо/src/InformationRegisters/ИсторияИзмененияФорматовМагазинов/ИсторияИзмененияФорматовМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененияФорматовМагазинов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РозничныеЦеныИзФорматаМагазина</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/InformationRegisters/ТоварныеОграничения/ТоварныеОграничения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоварныеОграничения</name>
  <resources>
    <name>СтраховоеКоличествоЗапаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальноеКоличествоЗапаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗапаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаПотребления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодОбеспеченияПотребностей</name>
    <type>
      <types>EnumRef.МетодыОбеспеченияПотребностей</types>
    </type>
  </resources>
  <resources>
    <name>УпаковкаЗаказа</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ОбеспечениеЗаказовПриПоддержанииЗапаса</name>
    <type>
      <types>EnumRef.ОбеспечениеЗаказовПриПоддержанииЗапаса</types>
    </type>
  </resources>
  <resources>
    <name>СреднедневноеПотребление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднееОтклонениеПотребления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчетаРекомендаций</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДействующийПараметр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРекомендацияПоИзменению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГруппировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппировкаТоварныхОграничений</name>
    <type>
      <types>CatalogRef.ГруппировкиТоварныхОграничений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/Documents/ИзменениеАссортимента/ИзменениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеАссортимента</name>
  <registerRecords>InformationRegister.Ассортимент</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииИзмененияАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>EnumRef.СтадииАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектПланирования</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыИзмененияАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>КоллекцияНоменклатуры</name>
    <type>
      <types>CatalogRef.КоллекцииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЗакупок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаЗакупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПродаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаПродажи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>РольАссортимента</name>
      <type>
        <types>EnumRef.РолиАссортимента</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>РейтингПродаж</name>
      <type>
        <types>CatalogRef.РейтингиПродажНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Торговля_11__демо/src/DataProcessors/НастройкаПоддержанияЗапасов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуУстановитьПоддержаниеЗапасов(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ТоварныеОграничения)
		И ПравоДоступа("Просмотр", Метаданные.Обработки.НастройкаПоддержанияЗапасов) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииУТКлиент.УстановитьПоддержаниеЗапасов";
		КомандаСоздатьНаОсновании.Идентификатор = "УстановитьПоддержаниеЗапасов";
		КомандаСоздатьНаОсновании.Представление = НСтр("ru = 'Установить поддержание запасов'");
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьРасширенноеОбеспечениеПотребностей";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДобавитьКомандуНастройкаПоддержанияЗапасов(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Обработки.НастройкаПоддержанияЗапасов) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииУТКлиент.НастройкаПоддержанияЗапасов";
		КомандаСоздатьНаОсновании.Идентификатор = "НастройкаПоддержанияЗапасов";
		КомандаСоздатьНаОсновании.Представление = НСтр("ru = 'Настройка поддержания запасов'");
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьРасширенноеОбеспечениеПотребностей";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция УстановитьПоддержаниеЗапасовДляДокументаИзмененияАссортимента(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеАссортиментаТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Форматы.Склад, ИзменениеАссортимента.ОбъектПланирования) КАК Склад
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	Документ.ИзменениеАссортимента КАК ИзменениеАссортимента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеАссортимента.Товары КАК ИзменениеАссортиментаТовары
		|		ПО (ИзменениеАссортиментаТовары.Ссылка = ИзменениеАссортимента.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияФорматовМагазинов.СрезПоследних КАК Форматы
		|		ПО (Форматы.ФорматМагазина = ИзменениеАссортимента.ОбъектПланирования)
		|ГДЕ
		|	ИзменениеАссортимента.Ссылка = &ДокументИзмененияАссортимента
		|		И ЕСТЬNULL(Форматы.Склад, ИзменениеАссортимента.ОбъектПланирования) ССЫЛКА Справочник.Склады
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТовары.Номенклатура КАК Номенклатура,
		|	ВтТовары.Склад КАК Склад
		|ИЗ
		|	ВтТовары КАК ВтТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
		|		ПО ВтТовары.Номенклатура = ТоварныеОграничения.Номенклатура
		|			И ВтТовары.Склад = ТоварныеОграничения.Склад
		|			И (ТоварныеОграничения.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|ГДЕ
		|	ТоварныеОграничения.Склад ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДокументИзмененияАссортимента", ДокументСсылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	Если Выборка.Количество = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КлючиЗаписей = Новый Массив;
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючЗаписиТовара = РегистрыСведений.ТоварныеОграничения.КлючЗаписиНоменклатуры();
		КлючЗаписиТовара.Номенклатура = Выборка.Номенклатура;
		КлючЗаписиТовара.Склад = Выборка.Склад;
		КлючиЗаписей.Добавить(КлючЗаписиТовара);
	КонецЦикла;
	
	РегистрыСведений.ТоварныеОграничения.ДобавитьПоддержаниеЗапасаМинМакс(КлючиЗаписей);
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли
